-- ## 02-21
-- SQL表达式
-- count()
-- min()
-- max()
-- avg()
-- length()
-- UPDATE

.print "\n1. ================================="
-- Allen搬去和Paul一起住了，更新Allen的地址，输出更改后的表
-- 语句中不能出现具体地址



.print "\n2. ================================="
-- 输出最高工资与最低工资的差值
-- 语句中不能出现具体工资



.print "\n3. ================================="
-- 输出30岁以下的人的平均工资



.print "\n4. ================================="
-- 输出住址字数最短的人的姓名



.print "\n5. ================================="
-- 输出姓名为Kim的记录总共有几行



.print "\n5. ================================="
-- 输出姓名为Kim的记录中最小的ID号
